<template>
    <footer class="footer">
        <div class="inner container">
            <div class="footer-content">
                <a href="mailto:wishlist@yandex.ru" class="email">wishlist@yandex.ru</a>

                <div class="social">
                  <a href="#" class="social-icon">
                    <svg width="40" height="41" viewBox="0 0 50 51" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M25.2486 1.1956e-07C20.8071 -0.000437562 16.4473 1.20082 12.6259 3.47791C8.80447 5.75501 5.66213 9.02412 3.5281 12.9427C1.39406 16.8614 0.346887 21.2853 0.496286 25.7509C0.645684 30.2166 1.98616 34.5596 4.37726 38.325L0.168052 48.1232C0.0139994 48.4817 -0.0355351 48.877 0.025228 49.2627C0.0859911 49.6485 0.254546 50.009 0.511229 50.302C0.767912 50.5951 1.10214 50.8087 1.47492 50.9179C1.84769 51.0271 2.24365 51.0274 2.6166 50.9188L14.6137 47.4174C17.9687 49.0202 21.6391 49.8432 25.3531 49.8255C29.0671 49.8079 32.7296 48.95 36.0694 47.3155C39.4092 45.6809 42.3408 43.3116 44.6471 40.3829C46.9534 37.4541 48.5753 34.041 49.3927 30.3962C50.2102 26.7514 50.2023 22.9684 49.3695 19.3271C48.5368 15.6858 46.9006 12.2796 44.582 9.3607C42.2635 6.44178 39.322 4.08488 35.9754 2.46454C32.6287 0.844187 28.9627 0.00188695 25.2486 1.1956e-07ZM28.9938 32.473C27.9783 33.0772 25.7536 33.2611 21.5253 29.0074C17.297 24.7536 17.4799 22.5183 18.0804 21.494C19.609 21.3374 21.0749 20.3076 22.4343 18.9401C23.4415 17.9267 22.6254 15.469 20.6163 13.4478C18.6045 11.4239 16.1614 10.6056 15.1569 11.6161C8.68201 18.1272 11.9249 26.6704 17.8866 32.6707C23.9302 38.7507 32.1848 42.0845 38.8153 35.4169C39.8198 34.4035 39.0063 31.9457 36.9945 29.9246C34.9827 27.9007 32.5397 27.0823 31.5351 28.0929C30.173 29.4605 29.1494 30.9352 28.9965 32.473" fill="white"/>
                    </svg>
                  </a>
                  <a href="#" class="social-icon">
                    <svg width="40" height="40" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M25 0C11.2 0 0 11.2 0 25C0 38.8 11.2 50 25 50C38.8 50 50 38.8 50 25C50 11.2 38.8 0 25 0ZM36.6 17C36.225 20.95 34.6 30.55 33.775 34.975C33.425 36.85 32.725 37.475 32.075 37.55C30.625 37.675 29.525 36.6 28.125 35.675C25.925 34.225 24.675 33.325 22.55 31.925C20.075 30.3 21.675 29.4 23.1 27.95C23.475 27.575 29.875 21.75 30 21.225C30.0174 21.1455 30.0151 21.0629 29.9933 20.9845C29.9715 20.9061 29.9309 20.8342 29.875 20.775C29.725 20.65 29.525 20.7 29.35 20.725C29.125 20.775 25.625 23.1 18.8 27.7C17.8 28.375 16.9 28.725 16.1 28.7C15.2 28.675 13.5 28.2 12.225 27.775C10.65 27.275 9.425 27 9.525 26.125C9.575 25.675 10.2 25.225 11.375 24.75C18.675 21.575 23.525 19.475 25.95 18.475C32.9 15.575 34.325 15.075 35.275 15.075C35.475 15.075 35.95 15.125 36.25 15.375C36.5 15.575 36.575 15.85 36.6 16.05C36.575 16.2 36.625 16.65 36.6 17Z" fill="white"/>
                    </svg>
                  </a>
                </div>
            </div>

            <div class="footer-links">
              <a href="#" class="link">Пользовательское соглашение</a>
              <a href="#" class="link">Политика конфиденциальности</a>
              <a href="#" class="link">Оферта</a>
            </div>

            <div class="copyright">© 2026</div>
        </div>
    </footer>
</template>

<script setup lang="ts">
</script>

<style scoped>
.footer {
    background-color: var(--color-primary);
}

.inner {
    display: flex;
    flex-direction: column;
    color: var(--color-white);
    padding: 80px 30px 80px 30px;
}

.footer-content {
    display: flex;
    justify-content: end;
    align-items: center;
    gap: 55px;
    margin-bottom: 60px;
}

.email {
    font-size: 30px;
}

.social {
    display: flex;
    gap: 10px;
}

.footer-links {
    display: flex;
    justify-content: center;
    gap: 30px;
    margin-bottom: 35px;
}

.link {
    display: flex;
    align-items: center;
    font-size: 30px;
}

.link:not(:last-child)::after {
  content: '•';
  font-size: 60px;
  line-height: 0%;
  padding-left: 30px;
}

.copyright {
    display: flex;
    justify-content: center;
    font-size: 30px;
}
</style>